In [5]:
import pandas as pd

df_movies = pd.read_csv('data_files/IMDb movies.csv', low_memory=False)
df_movies

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,NaN,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,Le lion,2020,2020-01-29,Comedy,95,"France, Belgium",French,Ludovic Colbeau-Justin,...,"Dany Boon, Philippe Katerine, Anne Serra, Samu...",A psychiatric hospital patient pretends to be ...,5.3,398,NaN,NaN,$ 3507171,NaN,NaN,4.0
85851,tt9911196,De Beentjes van Sint-Hildegard,De Beentjes van Sint-Hildegard,2020,2020-02-13,"Comedy, Drama",103,Netherlands,"German, Dutch",Johan Nijenhuis,...,"Herman Finkers, Johanna ter Steege, Leonie ter...",A middle-aged veterinary surgeon believes his ...,7.7,724,NaN,NaN,$ 7299062,NaN,6.0,4.0
85852,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,Drama,130,India,Malayalam,Vineesh Aaradya,...,"Anoop Chandran, Indrans, Sona Nair, Simon Brit...",NaN,7.9,265,NaN,NaN,NaN,NaN,NaN,NaN
85853,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,"Drama, Family",98,Turkey,Turkish,Ahmet Faik Akinci,...,"Ahmet Faik Akinci, Belma Mamati, Metin Keçeci,...",NaN,6.4,194,NaN,NaN,$ 2833,NaN,NaN,NaN
85854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,2020-02-05,Drama,74,Spain,Catalan,Laura Jou,...,"Maria Morera Colomer, Biel Rossell Pelfort, Is...","Pep, a 13-year-old boy, is in love with a girl...",6.7,102,NaN,NaN,$ 59794,NaN,NaN,2.0

In [6]:
df_ratings = pd.read_csv('data_files/IMDb ratings.csv')

In [7]:
df_ratings

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,5.9,154,5.9,6.0,12,4,10,43,28,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,6.1,589,6.3,6.0,57,18,58,137,139,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,5.8,188,6.0,6.0,6,6,17,44,52,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0
3,tt0002101,5.2,446,5.3,5.0,15,8,16,62,98,...,5.5,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0
4,tt0002130,7.0,2237,6.9,7.0,210,225,436,641,344,...,7.3,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,5.3,398,5.5,6.0,13,9,26,65,104,...,5.7,11.0,5.0,2.0,5.5,12.0,6.3,22.0,5.3,214.0
85851,tt9911196,7.7,724,7.9,8.0,65,139,288,170,42,...,8.0,47.0,7.3,30.0,7.0,6.0,6.8,13.0,7.7,388.0
85852,tt9911774,7.9,265,7.8,8.0,63,29,61,61,31,...,NaN,NaN,NaN,NaN,1.0,1.0,NaN,NaN,2.0,2.0
85853,tt9914286,6.4,194,9.4,10.0,176,0,2,2,1,...,NaN,NaN,7.0,1.0,4.0,3.0,1.7,5.0,5.8,5.0
85854,tt9914942,6.7,102,6.8,7.0,4,4,21,35,27,...,6.8,4.0,7.5,4.0,7.0,4.0,6.7,13.0,6.7,60.0

In [8]:
df_movies.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [9]:
df_movies = df_movies[['imdb_title_id', 'title', 'year', 'genre', 'country']]
df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

In [10]:
df_movies

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [11]:
df_ratings

      imdb_title_id  total_votes  mean_vote
0         tt0000009          154        5.9
1         tt0000574          589        6.3
2         tt0001892          188        6.0
3         tt0002101          446        5.3
4         tt0002130         2237        6.9
...             ...          ...        ...
85850     tt9908390          398        5.5
85851     tt9911196          724        7.9
85852     tt9911774          265        7.8
85853     tt9914286          194        9.4
85854     tt9914942          102        6.8

[85855 rows x 3 columns]

In [12]:
df_sample = df_movies.sample(frac=0.5)
df_sample

,imdb_title_id,title,year,genre,country
46709,tt0436721,Ri ri ye ye,2004,Drama,"China, France"
41435,tt0308290,Fung hung bei Cup,2002,Comedy,Hong Kong
22099,tt0089671,Nattseilere,1986,"Adventure, Drama",Norway
69185,tt2941274,Sari siyah,2013,"Drama, History, War",Turkey
54378,tt1131743,Necrosis,2009,"Horror, Thriller",USA
...,...,...,...,...,...
51366,tt0905372,La cosa,2011,"Horror, Mystery, Sci-Fi","Canada, USA, UK"
5899,tt0040559,La macchina ammazzacattivi,1952,"Comedy, Fantasy",Italy
58224,tt1447508,Peepli [Live],2010,"Comedy, Drama",India
27504,tt0107618,Vendetta eterna,1993,Horror,USA
18362,tt0077304,Il gatto e il canarino,1978,"Comedy, Mystery, Horror",UK

In [13]:
print(df_sample.shape)
print(df_movies.shape)

(42928, 5)
(85855, 5)

In [14]:
df_concat = pd.concat([df_movies, df_sample])
df_concat.shape

(128783, 5)

In [15]:
df_movies.set_index('imdb_title_id', inplace=True)
df_ratings.set_index('imdb_title_id', inplace=True)
df_movies

,title,year,genre,country
imdb_title_id,,,,
tt0000009,Miss Jerry,1894,Romance,USA
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
tt0002101,Cleopatra,1912,"Drama, History",USA
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...
tt9908390,Le lion,2020,Comedy,"France, Belgium"
tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [16]:
df_concat_horiz = pd.concat([df_movies, df_ratings])
df_concat_horiz

,title,year,genre,country,total_votes,mean_vote
imdb_title_id,,,,,,
tt0000009,Miss Jerry,1894,Romance,USA,NaN,NaN
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,NaN,NaN
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN
tt0002101,Cleopatra,1912,"Drama, History",USA,NaN,NaN
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,NaN,NaN
...,...,...,...,...,...,...
tt9908390,NaN,NaN,NaN,NaN,398.0,5.5
tt9911196,NaN,NaN,NaN,NaN,724.0,7.9
tt9911774,NaN,NaN,NaN,NaN,265.0,7.8
tt9914286,NaN,NaN,NaN,NaN,194.0,9.4
tt9914942,NaN,NaN,NaN,NaN,102.0,6.8

In [17]:
df_movies

,title,year,genre,country
imdb_title_id,,,,
tt0000009,Miss Jerry,1894,Romance,USA
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
tt0002101,Cleopatra,1912,"Drama, History",USA
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...
tt9908390,Le lion,2020,Comedy,"France, Belgium"
tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [18]:
df_ratings

               total_votes  mean_vote
imdb_title_id
tt0000009              154        5.9
tt0000574              589        6.3
tt0001892              188        6.0
tt0002101              446        5.3
tt0002130             2237        6.9
...                    ...        ...
tt9908390              398        5.5
tt9911196              724        7.9
tt9911774              265        7.8
tt9914286              194        9.4
tt9914942              102        6.8

[85855 rows x 2 columns]

In [19]:
df_inner_join = df_movies.merge(df_ratings, on='imdb_title_id', how='inner')
df_inner_join

,title,year,genre,country,total_votes,mean_vote
imdb_title_id,,,,,,
tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...
tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

In [20]:
df_inner_join.shape

(85855, 6)

In [21]:
df_movies.shape

(85855, 4)

In [36]:
df_full_outer_join = df_movies.merge(df_ratings, on='imdb_title_id', how='outer', indicator=True)
df_full_outer_join.query("_merge=='left_only' or _merge=='right_only'")

Empty DataFrame
Columns: [title, year, genre, country, total_votes, mean_vote, _merge]
Index: []

In [46]:
df_sample_2 = df_movies.sample(frac=0.5)

In [47]:
df_sample_2

,title,year,genre,country
imdb_title_id,,,,
tt0132502,The Secret Laughter of Women,1999,"Comedy, Drama, Romance","UK, Canada, Nigeria"
tt2800356,Benoît Brisefer: Les taxis rouges,2014,"Adventure, Comedy, Family","France, Belgium"
tt2636488,Hello Carter,2013,"Comedy, Drama",UK
tt0092926,Dragon Hunt,1990,Action,Canada
tt2341766,Nautanki Saala!,2013,Comedy,India
...,...,...,...,...
tt7935392,Limbo,2019,"Comedy, Drama, Horror",USA
tt3924144,OzLand,2014,"Drama, Fantasy, Sci-Fi",USA
tt3044448,Jaanu,2012,"Action, Drama, Romance",India
tt0432432,Rag Tale,2005,"Comedy, Romance, Drama","UK, Luxembourg"
tt2038245,Alzheimer,2011,"Drama, Family, Mystery",Iran

In [49]:
df_left_2 = df_sample_2.merge(df_ratings, on='imdb_title_id', how='left')
df_left_2

,title,year,genre,country,total_votes,mean_vote
imdb_title_id,,,,,,
tt0132502,The Secret Laughter of Women,1999,"Comedy, Drama, Romance","UK, Canada, Nigeria",621,6.6
tt2800356,Benoît Brisefer: Les taxis rouges,2014,"Adventure, Comedy, Family","France, Belgium",141,4.9
tt2636488,Hello Carter,2013,"Comedy, Drama",UK,312,6.2
tt0092926,Dragon Hunt,1990,Action,Canada,172,3.0
tt2341766,Nautanki Saala!,2013,Comedy,India,4087,6.1
...,...,...,...,...,...,...
tt7935392,Limbo,2019,"Comedy, Drama, Horror",USA,304,5.3
tt3924144,OzLand,2014,"Drama, Fantasy, Sci-Fi",USA,442,6.3
tt3044448,Jaanu,2012,"Action, Drama, Romance",India,163,6.6
tt0432432,Rag Tale,2005,"Comedy, Romance, Drama","UK, Luxembourg",332,4.3
tt2038245,Alzheimer,2011,"Drama, Family, Mystery",Iran,283,5.5

In [62]:
df_movies_2 = pd.read_csv('data_files/IMDb movies.csv', low_memory=False)
df_movies_2 = df_movies_2[['imdb_title_id', 'title', 'year', 'genre', 'country']]
df_movies_2

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [63]:
for index in range(0,1000):
    df_movies_2.loc[index, 'imdb_title_id'] = 'tt1234567890'

In [70]:
df_movies_2.merge(df_ratings,on = 'imdb_title_id', how = 'outer', indicator=True).query("_merge=='left_only'")

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
0,tt1234567890,Miss Jerry,1894,Romance,USA,NaN,NaN,left_only
1,tt1234567890,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,NaN,NaN,left_only
2,tt1234567890,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN,left_only
3,tt1234567890,Cleopatra,1912,"Drama, History",USA,NaN,NaN,left_only
4,tt1234567890,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...
995,tt1234567890,Agente segreto Z1,1930,Drama,USA,NaN,NaN,left_only
996,tt1234567890,Tom Sawyer,1930,"Adventure, Comedy, Drama",USA,NaN,NaN,left_only
997,tt1234567890,Tonka Sibenice,1930,Drama,"Czechoslovakia, Germany",NaN,NaN,left_only
998,tt1234567890,Top Speed,1930,"Comedy, Musical, Romance",USA,NaN,NaN,left_only
999,tt1234567890,True to the Navy,1930,"Action, Comedy, Romance",USA,NaN,NaN,left_only

In [71]:
df_movies_2.shape

(85855, 5)